<?php
echo("<CENTER><b><BIG>Часто задаваемые вопросы...</b></BIG></CENTER>");
?>
<a name=top>
<font size=3>Здесь собраны наиболее часто задаваемые вопросы по пользованию форумом.<br>
<table align=center width=80%><td align=left>
<a href=#browser>Поддержка браузеров</a><br>
<a href=#register>Что даёт регистрация?</a><br>
<a href=#howregister>Как зарегистрироваться?</a><br>
<a href=#howenter>Как войти?</a><br>
<a href=#whatremember>Что такое "запомнить меня"?</a><br>
<a href=#profile>Что такое профиль?</a><br>
<a href=#avatar>Что такое аватара и как её загрузить?</a><br>
<a href=#hownew>Как добавить новую тему?</a><br>
<a href=#howanswer>Как добавить ответ на тему?</a><br>
<a href=#raiting>Что такое рейтинг и как он растёт?</a><br>
<a href=#zvanie>Что такое звания(ранги)? Как они зарабатываются?</a><br>
<a href=#howwho>Как узнать кто на форуме?</a><br>
<a href=#whatwords>Что означают слова "последнее сообщение" "просмотров" "ответов"?</a><br>
<a href=#question01>Настройка собщения</a><br>
<a href=#myquestionabsent>Здесь нет моего вопроса.</a><br>
<tr><td>
<a name=browser><center><u>Поддержка браузеров</u></center>
Форум поддерживает большинство современных популярных браузеров. Среди них:
MS Internet Explorer >=5, Opera >=6, Mozilla >=5;<br>
Тем не менее, всё-таки лучше использовать IE, поскольку под него форум и разрабатывался инзначально.<Br>
Не рекомендуемые Интернет-браузеры:  Netscape <=6; 
<br><a href=#top>Наверх</a><br>
<a name=register><center><u>Что даёт регистрация?</u></center>
Регистрация позволяет вам быть полноправным членом форума, писать свои сообщения, создавать новые темы, добавлять голосования и т.п.
Так же вы сможете пользоваться приватом форума.<br>
Так же, если вы зарегистрируетесь, вы сможете загрузить свою аватару, отредактировать свой профиль, вы получите ранг, который будет расти
в зависимости от количества ваших сообщений. Так же для вас будет идти учёт рейтинга, основанный на количестве написанных вами сообщений и
созданных тем.
<br><a href=#top>Наверх</a><br>
<a name=howregister><center><u>Как зарегистрироваться?</u></center>
Вы указываете всего лишь ту информацию, которую сочтёте необходимым указать. Для регистрации нужно обязательно указать
"логин"(ваш ник, имя, что хотите, лишь бы без разных специальных символов, вроде @# и т.п.) и "пароль"(любое слово, набор букв, символов, лишь бы вы его запомнили и могли бы потом запросто вспомнить для входа на форум). 
Указывайте только их, никто не потребует указать больше. Единственное, что нужно ещё выбрать- это ваш пол. По-умолчанию он установлен 
в "мужской". Будьте внимательны! Изменить пол потом нельзя! <br>
Чтобы зарегистрироваться на форуме, укажите всю желаемую информацию (всё кроме логина и пола можно впоследствии изменить), и нажмите
кнопку "региться". Если вы укажете свой e-mail, то инфа, которую вы укажете будет выслана вам на ящик, если нет, то она будет показана вам, чтобы
вы смогли её сохранить.
<br><a href=#top>Наверх</a><br>
<a name=howenter><center><u>Как войти?</u></center>
Чтобы войти на форум, необходимо нажать ссылку "войти", затем указать свой логин, пароль и нажать кнопку. Вы попадёте в свой "<a href=#profile>профиль</a>", где сможете
изменить информацию о себе и загрузить <a href=#avatar>аватару</a>.
<br><a href=#top>Наверх</a><br>
<a name=whatremember><center><u>Что такое "запомнить меня"?</u></center>
Если вы отметиие галочку "запомнить меня", то сможете долгое время заходить на форум, и он будет вас узнавать. Вам не будет нужно снова авторизоваться.
<br><a href=#top>Наверх</a><br>
<a name=profile><center><u>Что такое профиль?</u></center>
Профиль- страница, где отображаются все ваши личные данные. Здесь вы можете изменить кое-какую информацию о себе, свой пароль и т.п. Изменив все
желаемые поля, нажмите кнопку "изменить" и всё.
<br><a href=#top>Наверх</a><br>
<a name=avatar><center><u>Что такое аватара и как её загрузить?</u></center>
Аватара- это как бы ваше изображение, ваша лого-картинка, которая будет символизировать вас на форуме. Если вы загрузите аватару, она будет отображаться
слева от каждого вашего сообщения. Чтобы её загрузить, нажмите кнопку "обзор", выберите GIF-картинку, размером не более <?php echo($vars['avatar_maxwidth']."x".$vars['avatar_maxheight']); ?> пикселей и объёмом не более
<?php echo($vars['avatar_maxsize']);?> KB, и нажмите "загрузить". 
<br><a href=#top>Наверх</a><br>
<a name=hownew><center><u>Как добавить новую тему?</u></center>
Чтобы добавить новую тему на форуме, надо нажать в меню сверху или снизу "новая тема" и заполнив предлагаемые поля, нажать кнопку "добавить тему".
<br><a href=#top>Наверх</a><br>
<a name=howanswer><center><u>Как добавить ответ на тему?</u></center>
При просмотре темы появится кнопка "ответить" вверхнем или нижнем меню форума. Нажав на неё и заполнив необходимые поля, надо нажать "ответить".
<br><a href=#top>Наверх</a><br>
<a name=raiting><center><u>Что такое рейтинг и как он растёт?</u></center>
Рейтинг- это ваш ранг на форуме. Он вычисляется в зависимости от вашей активности. Чем больше вы пишете сообщений, тем больше ваш рейтинг. Он отображается
рядом с каждым вашим сообщением в виде звёздочек. Главное- проявлять активность. Потому что если вы долгое время ничего писать не будете, ваш рейтинг постепенно упадёт.
<br><a href=#top>Наверх</a><br>
<a name=zvanie><center><u>Что такое звания? Как зарабатываются звания?</u></center>
Звание- это ваш ранг на форуме. Опять же, как и рейтинг звание повышается в зависимости от количества ваших сообщений. 
Вот местная иерархия:<br>
<?php 
for($i=0;$i<$vars['rangs_count'];$i++)
	{
	echo("Для достижения звания ".$rangs[$i]['rang']." нужно написать ".$rangs[$i]['count']." сообщений<br>");
	}

?>
<br><a href=#top>Наверх</a><br>
<a name=howwho><center><u>Как узнать кто на форуме?</u></center>
Количество посетителей (или (если они зарегистрированы) их имена), отображается внизу любой страницы форума.
Гостей: к-во - это сколько в данный момент незарегистрированных (или не авторизованных) пользователей на форуме. <Br>
Эти данные основаны на активности посетителей за посл. <?php echo($vars['time_exit']/60); ?> мин.
<br><a href=#top>Наверх</a><br>
<a name=whatwords><center><u>Что означают слова "последнее сообщение" "просмотров" "ответов"?</u></center>
Поле "последнее сообшение" показывает кто написал самое последнее сообщение в ту или иную тему. Вы можете легко посмотреть это
сообщение, кликнув на маленькую картинку <img src="<?php echo($file_last); ?>">. Вы будете перемещены в самый конец темы.<Br>
Поле "просмотов" показывает сколько раз была запрошена тема. <br>
Поле "ответов" показывает просто сколько ответов добавлено по данной теме.
<br><a href=#top>Наверх</a><br>

<a name=question01><center><u>Настройка сообщения.</u></center>
Сообщение можно настраивать по вашему вкусу. "Жирно" означает, что выделенный текст будет более жирным, чем остальной, курсив-текст будет под наклоном, подчеркнуть- подчёркивает выделенный текст, центрирование-центрует...:)<Br>
Так же можно вставлять цитаты и картинки. Чтобы вставить цитату, сначала скопируйте тот текст, который хотите цитировать, затем выделите его в текстовом поле и нажмите "цитировать". Чтобы цитировать определённого человека, 
проделайте те же действия, только вместо кнопки "цитировать" нажмите "цит. чел.", затем в предлагаемом окне введите ник того, кого хотите цитировать и нажмите ОК.<br>
Чтобы вставить картинку, сначала скопируйте её адрес в поле для ввода, а затем выделите и нажмите "картинка".
В сообщении так же можно использовать смайлы, кликните на картинку и код смайла добавится!
<br><a href=#top>Наверх</a><br>

<a name=myquestionabsent><center><u>Здесь нет моего вопроса.</u></center>
Нет вашего вопроса? Смело задавайте его прямо на форуме или на мыло: <a href="mailto:<?php echo($vars['your_email']); ?>"><?php echo($vars['your_email']); ?></a>.
<br><a href=#top>Наверх</a><br>


</table>